# FabricationDimensionDefinition Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationDimensionDefinition Properties
FabricationDimensionDefinition Class See Also
---
The FabricationDimensionDefinition type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsModifiable | If the fabrication dimension is modifiable by user. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | Fabrication dimension name. |
| Type | Fabrication dimension type. |
| UnitType | Fabrication dimension unit type. |

# See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace